[
    {
        "id": 1,
        "command": {
            "command": "play",
            "nextId": 2}
    },
    {
        "id": 2,
        "command": {
            "command": "enter",
            "nextId": 3},
        "text": "In a dark forest at the foot of a snow-capped mountain there was a cave and a troll dwelled in it. When the young man from the village gazed into the cave's entrance he shivered. His thoughts returned to the village in the valley beyond the river. It was not far. A young woman lived there by an old broken oak. She was the miller's daughter and probably preparing the evening meal for her father at this hour. Would she think him a fool for coming to this place? Once more the young man felt the embers of courage burn in his heart and move his limbs. Thus, he stepped forth to ",
        "text2": " the cave of the troll."
    },
    {
        "id": 3,
        "command": {
            "command": "use",
            "nextId": 4},
        "command2": "sword",
        "text": "The flame of the young man's torch guttered its light cast against rock and darkness and bone. They seemed the remains of an ox; strips of meat still clove to its rips. Outside the cave a thunderclap cracked, hit the mountain's flank, and resounded through its rock. What had not been obscured by the forest's own dimniss now was veiled in heavy rain. A flash of lightning pierced the downpour, cut a thickset shape in the cave's entrance. It disappeared with the light. When the troll came the torch's glow drew shadows on its ugly visage. The young man reached for his weapon though it suddenly seemed foolish to ",
        "text2": " such a little thing against this towering mass. (Hint: Open your inventory to see the weapon you can use.)"
    },
    {
        "id": 4,
        "command": {
            "command": "take",
            "nextId": 5},
        "command2": "jawbone",
        "text": "The sword broke in two upon the troll's hide; the blade clinked and clanked on the cold stone floor; its hilt slipped from the young man's grip. In its place he thrust up his torch and panted a prayer unsure whether it was the troll's fist or the tempest that shook the mountain. Through the fire a fat hand groped for the youg man and he fell between the bones and scraps. As the troll grapped him he stretched out his own hand to ",
        "text2": " the ox's jawbone."
    },
    {
        "id": 5,
        "command": {
            "command": "use",
            "nextId": 6},
        "command2": "jawbone",
        "text": "The young man squirmed in the troll's brutish hand and raised the ox's jawbone to ",
        "text2": " it in a final attempt to slay the creature."
    },
    {
        "id": 6,
        "command": {
            "command": "leave",
            "nextId": 7
        },
        "command3": {
            "command": "pursue",
            "nextId": 8
        },
        "text": "The young man dropped and lost both torch and breath on impact with the rocky ground. In the forest lightning illumined the troll's struggle. From its left eye a piece of the ox's jawbone jutted out. With time silence settled over the place. Even rain and thunder ceased. The young man got up on his knees bloody and beaten and victorious. What would the young woman from the village say about this? Scraping sounds disturbed the quiet of the cave; in its back where the torch had rolled a dwarf vanished in a cleft. The young man hesitated. Should he ",
        "text2": " and return to the village or ",
        "text3": " the dwarf deeper into the mountain?"
    },
    {
        "id": 7,
        "text": "The young man left the cave of the troll and returned home. THE END."
    },
    {
        "id": 8,
        "text": "The young man picked up his torch and followed the dwarf. THE END."
    }
]